Tekla Open API Reference for Tekla Structures 2025
UserPropertyLevelEnum Enumeration
The user property level.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum UserPropertyLevelEnum
Public Enumeration UserPropertyLevelEnum
Members
Member name | Value | Description
LEVEL_MODEL | 1 |  The user property has been defined as a model user property.
LEVEL_PROJECT | 2 |  The user property has been defined as a project user property.
LEVEL_FIRM | 3 |  The user property has been defined as a firm user property.
LEVEL_ENVIRONMENT | 4 |  The user property has been defined as an environment user property.
LEVEL_COMMONDEFAULT | 5 |  The user property has been defined as a common default user property.
See Also
Reference
Tekla.Structures.Catalogs Namespace